In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.array([3,56,23,22,55,32,77,57,88,99,97,35])
s = pd.Series(data)

In [4]:
type(s)

pandas.core.series.Series

In [7]:
#s
s[0]

3

In [8]:
s[0:4]

0     3
1    56
2    23
3    22
dtype: int32

In [11]:
ind = ['a','b','c','d','e','f','g','h','i','j','k','l']
# s = pd.Series(data, index=list('abcdefghij'))
s = pd.Series(data, index=ind)

In [12]:
s

a     3
b    56
c    23
d    22
e    55
f    32
g    77
h    57
i    88
j    99
k    97
l    35
dtype: int32

In [13]:
s.head()

a     3
b    56
c    23
d    22
e    55
dtype: int32

In [14]:
s.tail()

h    57
i    88
j    99
k    97
l    35
dtype: int32

In [15]:
data = {
    'names' : ['Sachin','Sehwag','Gambhir','Dhoni','Virat','Yuvraj','Ishant'],
    'score' : [67,45,23,89,110,80,None]
}

In [16]:
df = pd.DataFrame(data)

In [17]:
df

     names  score
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
3    Dhoni   89.0
4    Virat  110.0
5   Yuvraj   80.0
6   Ishant    NaN

In [18]:
df.head()

     names  score
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
3    Dhoni   89.0
4    Virat  110.0

In [20]:
df[df['names'] == 'Sehwag']

    names  score
1  Sehwag   45.0

In [21]:
df[df['score'] > 50]

    names  score
0  Sachin   67.0
3   Dhoni   89.0
4   Virat  110.0
5  Yuvraj   80.0

In [25]:
df.sort_values('score', ascending = False)

     names  score
4    Virat  110.0
3    Dhoni   89.0
5   Yuvraj   80.0
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
6   Ishant    NaN